app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT 1  [["uid", "22893738"], ["provider", "github"]]
---
  def create
    # Build the auth_hash from the Github hash object
    auth_hash = request.env['omniauth.auth']

    # Check to see if we received the auth_hash from Github.
    if auth_hash == nil
      flash[:notice] = "Login Failed"
      return redirect_to root_path
    end

    @user = User.find_by(uid: auth_hash[:uid], provider: 'github')