app/controllers/tasks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @user = User.find_by(id: session[:user_id].to_i)
    @tasks = Task.where("user_id = ?", @user.id).to_a

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @mytask = Task.find(params[:id].to_i)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("user_id", "title", "description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Test Task"], ["description", "lasdfjkasdj"], ["completed", "f"], ["created_at", "2016-10-26 15:38:17.638317"], ["updated_at", "2016-10-26 15:38:17.638317"]]
---
  def create
    @user = User.find_by(id: session[:user_id].to_i)
    @mytask = Task.new
    @mytask.user_id = @user.id.to_i
    @mytask.title = params[:task][:title]
    @mytask.description = params[:task][:description]
    @mytask.completed = false
    @mytask.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @mytask = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "tasks" SET "title" = ?, "description" = ?, "completed" = ?, "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", nil], ["description", nil], ["completed", "t"], ["completed_at", "2016-09-30 17:15:19.606327"], ["updated_at", "2016-09-30 17:15:19.607367"], ["id", 4]]
---
  def update
    @mytask = Task.find(params[:id])
    @mytask.title = params[:task][:title]
    @mytask.description = params[:task][:description]
    @mytask.completed = params[:task][:completed]

    # If a task is marked as completed, completed_at is updated to the current Date & Time
    if @mytask.completed == true
      @mytask.completed_at = DateTime.now
    end

    @mytask.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
---
  def destroy
    Task.find(params[:id]).destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 46]]
UPDATE "tasks" SET "completed" = ?, "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", "t"], ["completed_at", "2016-09-30 21:58:09.012727"], ["updated_at", "2016-09-30 21:58:09.013039"], ["id", 46]]
---
  def complete
    @mytask = Task.find(params[:id])
    @mytask.completed = true
    @mytask.completed_at = DateTime.now
    @mytask.save